InformationRegisters/ПричиныУвольненияСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПричиныУвольненияСотрудников</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПричинаHR</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныУвольнений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаРуководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныУвольнений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/АнализТекучестиПерсонала/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("НачальноеЗаполнениеПодсистемыАнализТекучестиПерсонала");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбновлениеИнформационнойБазы

Процедура ЗарегистрироватьОбработчикиОбновления(Обработчики) Экспорт
	
	Если ЗарплатаКадрыРасширенныйПовтИсп.ЭтоНачальноеЗаполнениеИлиОбновление() Тогда
		Обработчик = Обработчики.Добавить();
		Обработчик.Процедура = "АнализТекучестиПерсонала.НачальноеЗаполнениеПодсистемыАнализТекучестиПерсонала";
		Обработчик.НачальноеЗаполнение = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура НачальноеЗаполнениеПодсистемыАнализТекучестиПерсонала(ПараметрыОбновления = Неопределено) Экспорт
	
	Если ПараметрыОбновления = Неопределено Тогда
		ПараметрыОбновления = Новый Структура("ОбработкаЗавершена");
	КонецЕсли;
	
	Справочники.ПричиныУвольнений.НачальноеЗаполнение();
	
	Константы.ИспользоватьАнализТекучестиПерсонала.Установить(Истина);
	
	ПараметрыОбновления.ОбработкаЗавершена = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ПанельНастроекУправлениеПерсоналом

// Обновляет значение константы "АнализаТекучестиПерсонала".
//
// Параметры:
//  Значение - Булево - значение константы.
//
Процедура ОбновитьИспользованиеАнализаТекучестиПерсонала(Знач Значение) Экспорт
	
	Константы.ИспользоватьАнализТекучестиПерсонала.Установить(Значение);
	
КонецПроцедуры

#КонецОбласти

#Область НастройкиВариантовОтчетов

// Содержит настройки размещения вариантов отчетов в панели отчетов.
// Описание см. ЗарплатаКадрыВариантыОтчетов.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчетов(Настройки) Экспорт
	
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.АнализТекучестиПерсонала);
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.ПричиныУвольнения);
	
КонецПроцедуры

#КонецОбласти

#Область УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	Списки.Вставить(Метаданные.РегистрыСведений.ПричиныУвольненияСотрудников, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область КадровыеДанныеСотрудников

Процедура ЗаполнитьПоляПредставленийКадровыхДанныхСотрудников(ДополнительныеПоляПредставлений, ПутьКПолямСотрудника, ИсключаемыеПоля) Экспорт
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьАнализТекучестиПерсонала") Тогда
		
		ОписаниеПоля = ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеДополнительногоПоляПредставлений();
		ОписаниеПоля.ИмяПоля = "ПричинаHR";
		ОписаниеПоля.ПустоеЗначениеНаЯзыкеЗапросов = "ЗНАЧЕНИЕ(Справочник.ПричиныУвольнений.ПустаяСсылка)";
		ОписаниеПоля.ЗаголовокПоляСКД = НСтр("ru='Причина увольнения по мнению HR'");
		ОписаниеПоля.ПутьПоляСКД = ПутьКПолямСотрудника + ".ПричинаHR";
		ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьПолеПредставления(ДополнительныеПоляПредставлений, ОписаниеПоля, ИсключаемыеПоля);
		
		ОписаниеПоля = ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеДополнительногоПоляПредставлений();
		ОписаниеПоля.ИмяПоля = "ПричинаРуководитель";
		ОписаниеПоля.ПустоеЗначениеНаЯзыкеЗапросов = "ЗНАЧЕНИЕ(Справочник.ПричиныУвольнений.ПустаяСсылка)";
		ОписаниеПоля.ЗаголовокПоляСКД = НСтр("ru='Причина увольнения по мнению руководителя'");
		ОписаниеПоля.ПутьПоляСКД = ПутьКПолямСотрудника + ".ПричинаРуководитель";
		ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьПолеПредставления(ДополнительныеПоляПредставлений, ОписаниеПоля, ИсключаемыеПоля);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаВТСведенийОПричинахУвольненияСотрудников(
	Запрос, ТолькоРазрешенные, ОписательВременнойТаблицыОтборов, ПоляОтбораПериодическихДанных, ИсточникиДанных) Экспорт
	
	Если ИсточникиДанных.Получить("ПричиныУвольненияСотрудников") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЧастиЗапроса = Новый Массив;
	ЧастиЗапроса.Добавить(Запрос.Текст);
	
	ЧастиЗапроса.Добавить(
		"	{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПричиныУвольненияСотрудников КАК ПричиныУвольненияСотрудников
		|	ПО (КадроваяИсторияСотрудников.Сотрудник = ПричиныУвольненияСотрудников.Сотрудник)}");
	
	Запрос.Текст = СтрСоединить(ЧастиЗапроса, Символы.ПС);
	
КонецПроцедуры

Функция ДобавитьПолеСведенийОПричинахУвольненияСотрудников(Знач ИмяПоля, ТекстыОписанияПолей, ИсточникиДанных) Экспорт
	
	ДобавленоПолеСведений = Ложь;
	Если НеобходимыСведенияОПричинахУвольненияСотрудников(ИмяПоля) Тогда
		
		ДобавленоПолеСведений = Истина;
		ИсточникиДанных.Вставить("ПричиныУвольненияСотрудников", Истина);
		
		ПутьКДанным = "ПричиныУвольненияСотрудников." + ИмяПоля;
		ТекстыОписанияПолей.Добавить(ПутьКДанным + " КАК " + ИмяПоля);
		
	КонецЕсли;
	
	Возврат ДобавленоПолеСведений;
	
КонецФункции

Функция НеобходимыСведенияОПричинахУвольненияСотрудников(Знач ИмяПоля)
	
	ИмяПоля = ВРег(ИмяПоля);
	
	Возврат ИмяПоля = ВРег("ПричинаHR")
		Или ИмяПоля = ВРег("ПричинаРуководитель");
	
КонецФункции

#КонецОбласти

// Формирует таблицу с причинами увольнения по сотрудникам.
// 
// Параметры:
// 	Сотрудники - Массив - массив сотрудников.
// 	
// Возвращаемое значение:
// 	ТаблицаЗначений - таблица с колонками
//		Сотрудник,
//		ПричинаHR,
//		ПричинаРуководитель,
//		ДатаРегистрации,
//		Ответственный,
//		Комментарий
//
Функция ПричиныУвольненияСотрудников(Сотрудники) Экспорт

	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьАнализТекучестиПерсонала") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Не ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ПричиныУвольненияСотрудников) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сотрудники", Сотрудники);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПричиныУвольнения.Сотрудник,
		|	ПричиныУвольнения.ПричинаHR,
		|	ПричиныУвольнения.ПричинаРуководитель,
		|	ПричиныУвольнения.ДатаРегистрации,
		|	ПричиныУвольнения.Ответственный,
		|	ПричиныУвольнения.Комментарий
		|ИЗ
		|	РегистрСведений.ПричиныУвольненияСотрудников КАК ПричиныУвольнения
		|ГДЕ
		|	ПричиныУвольнения.Сотрудник В (&Сотрудники)";
		
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

// Дополняет строку истории взаимоотношений физического лица о причинах увольнения сотрудника.
// 
// Параметры:
// 	СтрокаИстории - Строка - описание сотрудника в списке истории,
// 	Сотрудник - СправочникСсылка.Сотрудники,
// 	ПричиныУвольнения - ТаблицаЗначений - таблица по нескольким сотрудникам, сформированная методом ПричиныУвольненияСотрудников.
//
Процедура ДополнитьИсториюСотрудникаПричинойУвольнения(СтрокаИстории, Сотрудник, ПричиныУвольнения) Экспорт

	Если ПричиныУвольнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияБЗК.ДобавитьИндексКоллекции(ПричиныУвольнения, "Сотрудник");
	
	ПричиныСотрудника = ПричиныУвольнения.НайтиСтроки(Новый Структура("Сотрудник", Сотрудник));
	Если ПричиныСотрудника.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Если Не ПустаяСтрока(СтрокаИстории) Тогда
		СтрокаИстории = СтрокаИстории + ", ";
	КонецЕсли;

	СтрокаИстории = СтрокаИстории + СтрШаблон(НСтр("ru = 'уволен по причине «%1»'"), ПричиныСотрудника[0].ПричинаHR);
	
	Если ЗначениеЗаполнено(ПричиныСотрудника[0].Комментарий) Тогда
		СтрокаИстории = СтрокаИстории + ", " 
			+ СтрШаблон(НСтр("ru = 'с комментарием: «%1»'"), ПричиныСотрудника[0].Комментарий);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбновитьВидимостьПричиныУвольнения(Форма, СотрудникСсылка = Неопределено, ИмяЭлемента = "ПричинаУвольнения") Экспорт
	
	Элементы = Форма.Элементы;
	Если Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказыватьПричинуУвольнения = ПолучитьФункциональнуюОпцию("ИспользоватьАнализТекучестиПерсонала")
		И ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ПричиныУвольненияСотрудников);
		
	Если ПоказыватьПричинуУвольнения И НЕ СотрудникСсылка = Неопределено Тогда 
		ПоказыватьПричинуУвольнения = НЕ СотрудникСсылка.Пустая() 
			И РегистрыСведений.ПричиныУвольненияСотрудников.МожноРегистрироватьПричиныУвольнения(СотрудникСсылка);
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		ИмяЭлемента,
		"Видимость",
		ПоказыватьПричинуУвольнения);
		
КонецПроцедуры

Процедура ОбновитьПричинуУвольнения(Форма, СотрудникСсылка, ИмяЭлемента = "ПричинаУвольнения") Экспорт
	
	Если Форма.Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Форма[ИмяЭлемента] = РегистрыСведений.ПричиныУвольненияСотрудников.ПредставлениеПричинСотрудника(СотрудникСсылка);

КонецПроцедуры

Функция ПредставлениеПричинУвольненияСотрудника(СотрудникСсылка) Экспорт
	
	Если Не РегистрыСведений.ПричиныУвольненияСотрудников.МожноРегистрироватьПричиныУвольнения(СотрудникСсылка) Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат РегистрыСведений.ПричиныУвольненияСотрудников.ПредставлениеПричинСотрудника(СотрудникСсылка, , Ложь);
	
КонецФункции

#КонецОбласти
